khoih-prog/Blynk_Esp8266AT_WM/src/BlynkSimpleShieldEsp8266_WM.h
          return false;
      }  
      else if ( !strncmp(Blynk8266_WM_config.wifi_ssid,       NO_CONFIG, strlen(NO_CONFIG))   ||
                !strncmp(Blynk8266_WM_config.wifi_pw,         NO_CONFIG, strlen(NO_CONFIG) )  ||
                !strncmp(Blynk8266_WM_config.blynk_server,    NO_CONFIG, strlen(NO_CONFIG) )  ||
                !strncmp(Blynk8266_WM_config.blynk_token,     NO_CONFIG, strlen(NO_CONFIG) ) ) 
      {
        // If SSID, PW, Server,Token ="nothing", stay in config mode forever until having config Data.
        return false;
      }  
      else
      {
        displayConfigData();               
      }
      
      return true;
    }
    
    void saveConfigData()
    {      
      int calChecksum = calcChecksum();
      Blynk8266_WM_config.checkSum = calChecksum;
      BLYNK_LOG4(BLYNK_F("Save EEPROM, size = "), EEPROM.length(), BLYNK_F(", chkSum = "), calChecksum);
      
      EEPROM.put(EEPROM_START, Blynk8266_WM_config);
    }
		
    boolean connectToWifi(int timeout)
    {
      int sleep_time = 250;
      unsigned long currMillis = millis();

	    BLYNK_LOG1(BLYNK_F("con2WF: start"));
	    
	    // New from Blynk_WM v1.0.5
      if (static_IP != IPAddress(0, 0, 0, 0))
      {
        BLYNK_LOG1(BLYNK_F("Use static IP"));
        wifi->setStationIp(IPAddressToString(static_IP), IPAddressToString(static_GW), IPAddressToString(static_SN));       
      }
	
      while ( !wifi_connected && ( 0 < timeout ) && ( (millis() - currMillis) < (unsigned long) timeout )  )
      {
          BLYNK_LOG2(BLYNK_F("con2WF: spent millis = "), millis() - currMillis);
          
          if (connectWiFi(Blynk8266_WM_config.wifi_ssid, Blynk8266_WM_config.wifi_pw))
          {
            wifi_connected = true;
          }
          else
          {
            delay(sleep_time);
            timeout -= sleep_time;
          }
      }          

	    if (wifi_connected)
	    {
		    BLYNK_LOG1(BLYNK_F("con2WF: OK"));
		    displayWiFiData();
		  }
	    else
	    {
		    BLYNK_LOG1(BLYNK_F("con2WF: failed"));
		  }
	
      return wifi_connected;    
    }
    
    void handleRequest()
    {
      if (server)
      {
        String key    = server->arg("key");
        String value  = server->arg("value");
        
        static int number_items_Updated = 0;

        if (key == "" && value == "") 
        {
            String result = root_html_template;

            BLYNK_LOG1(BLYNK_F("hR: repl result"));
            
            // Reset configTimeout to stay here until finished.
            configTimeout = 0;

            result.replace("[[wf_id]]",     Blynk8266_WM_config.wifi_ssid);
            result.replace("[[wf_pw]]",     Blynk8266_WM_config.wifi_pw);
            result.replace("[[b_svr]]",     Blynk8266_WM_config.blynk_server);
            result.replace("[[b_pt]]",      String(Blynk8266_WM_config.blynk_port));
            result.replace("[[b_tok]]",     Blynk8266_WM_config.blynk_token);

            server->send(200, "text/html", result);
            BLYNK_LOG1(BLYNK_F("hR: sent"));

            return;
        }
        
        if (number_items_Updated == 0)
        {
          memset(&Blynk8266_WM_config, 0, sizeof(Blynk8266_WM_config));
          strcpy(Blynk8266_WM_config.header, BLYNK_BOARD_TYPE);
        }
        
        if (key == "wf_id")
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.wifi_ssid) -1)
              strcpy(Blynk8266_WM_config.wifi_ssid, value.c_str());
            else
              strncpy(Blynk8266_WM_config.wifi_ssid, value.c_str(), sizeof(Blynk8266_WM_config.wifi_ssid) -1);    
        }
        else if (key == "wf_pw") 
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.wifi_pw) -1)
              strcpy(Blynk8266_WM_config.wifi_pw, value.c_str());
            else
              strncpy(Blynk8266_WM_config.wifi_pw, value.c_str(), sizeof(Blynk8266_WM_config.wifi_pw) -1);    
        }

        else if (key == "b_svr") 
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.blynk_server) -1)
              strcpy(Blynk8266_WM_config.blynk_server, value.c_str());
            else
              strncpy(Blynk8266_WM_config.blynk_server, value.c_str(), sizeof(Blynk8266_WM_config.blynk_server) -1);      
        }
        else if (key == "b_pt") 
        {
            number_items_Updated++;
            Blynk8266_WM_config.blynk_port = value.toInt();
        }
        else if (key == "b_tok") 
        {
            number_items_Updated++;
            if (strlen(value.c_str()) < sizeof(Blynk8266_WM_config.blynk_token) -1)
              strcpy(Blynk8266_WM_config.blynk_token, value.c_str());
            else
              strncpy(Blynk8266_WM_config.blynk_token, value.c_str(), sizeof(Blynk8266_WM_config.blynk_token) -1);    
        }

        server->send(200, "text/html", "OK");
        
        if (number_items_Updated == NUM_CONFIGURABLE_ITEMS)
        {
          BLYNK_LOG1(BLYNK_F("hR: Upd EEPROM"));

          saveConfigData();

          BLYNK_LOG1(BLYNK_F("hR: Rst"));
          
          // TO DO : what command to reset
          // Delay then reset the board after save data
          delay(1000);
          resetFunc();  //call reset
        }
      }   // if (server)
    }
        
    void startConfigurationMode()
    {     
      #define CONFIG_TIMEOUT			60000L
                	
      // initialize ESP module
      WiFi.init(wifi->getUart());
      WiFi.configAP(portal_apIP);
      
      if ( (portal_ssid == "") || portal_pass == "" )
      {            
        String randomNum = String(random(0xFFFFFF), HEX);
        randomNum.toUpperCase();
        
        portal_ssid = "Mega_" + randomNum;
        portal_pass = "MyMega_" + randomNum;
      }
           	    
      BLYNK_LOG6(BLYNK_F("stConf: SSID = "), portal_ssid, BLYNK_F(", PW = "), portal_pass, BLYNK_F(", IP = "), portal_apIP);

      // start access point, AP only, channel 10
      int AP_channel = 10;
      WiFi.beginAP(portal_ssid.c_str(), AP_channel, portal_pass.c_str(), ENC_TYPE_WPA2_PSK, true);
      
      if (!server)
      {      
	      server = new ESP8266_AT_WebServer;
	    }
      
      // Don't know if it's working or not. Can we use ESP8266_Lib wifi TCP server for this ??
      
      //See https://stackoverflow.com/questions/39803135/c-unresolved-overloaded-function-type?rq=1
      
      if (server)
      {
        server->on("/", [this](){ handleRequest(); });
        server->begin();
      }

      // If there is no saved config Data, stay in config mode forever until having config Data.
      // or SSID, PW, Server,Token ="nothing"
      if (hadConfigData)
        configTimeout = millis() + CONFIG_TIMEOUT;                        
      else
        configTimeout = 0;
               
      configuration_mode = true;    
    }    
    
};


static BlynkTransportShieldEsp8266 _blynkTransport;
BlynkWifi Blynk(_blynkTransport);

#include <BlynkWidgets.h>

#endif
